cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'wget'
brew 'node'
brew 'npm'
brew 'vim'
brew 'git'
brew 'git-flow'
brew 'tig'
brew 'pre-commit'
brew 'imagemagick'
brew 'tmux'
brew 'ruby-build'
brew 'rbenv'
brew 'zsh'
brew 'the_silver_searcher'
brew 'dockutil'
brew 'bat'
brew 'exa'

# Basics
cask 'virtualbox'
cask 'python'
cask 'google-chrome'
cask 'firefox'

# Utility
cask 'iterm2'
cask 'the-unarchiver'

# Apps
cask 'gimp'
cask 'skitch'
cask 'tableplus'
cask 'libreoffice'
cask 'mattermost'

# Databases
brew 'mysql'
brew 'postgres'

# IDEs
cask 'sublime-text'
