tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'wget'
brew 'node'
brew 'vim'
brew 'git'
brew 'git-flow'
brew 'pre-commit'
brew 'imagemagick'
brew 'tmux'
brew 'ruby-build'
brew 'asdf'
brew 'zsh'
brew 'dockutil'
brew 'bat'
brew 'eza'
brew 'svn'

# Basics
brew 'python@3'
cask 'google-chrome'
cask 'firefox'
brew 'wp-cli'

# Utility
cask 'iterm2'
cask 'the-unarchiver'

# Apps
cask 'tableplus'
cask 'mattermost'

# Databases
brew 'mysql'
brew 'postgresql'

# IDEs
cask 'sublime-text'
cask 'visual-studio-code'

# Fonts
cask 'font-source-code-pro'
