cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/services'

brew 'wget'
brew 'node'
brew 'npm'
brew 'git-flow'
brew 'tig'
brew 'vim'
brew 'imagemagick'
brew 'tmux'
brew 'git'
brew 'ruby-build'
brew 'rbenv'
brew 'zsh'
brew 'the_silver_searcher'
brew 'dockutil'

# Basics
cask 'virtualbox'
cask 'vagrant'
cask 'google-chrome'
cask 'firefox'

# Utility
cask 'iterm2'
cask 'the-unarchiver'

# Apps
cask 'gimp'
cask 'skitch'
cask 'sequel-pro'
cask 'libreoffice'
cask 'skype'
cask 'slack'
cask 'github-desktop'

# IDEs
cask 'phpstorm'
cask 'sublime-text'
cask 'atom'
